app/graphql/mutations/search.rb

    def resolve(input)
      @am = AppMap.first
---
SELECT "app_maps".* FROM "app_maps" ORDER BY "app_maps"."id" ASC LIMIT $1  [["LIMIT", 1]]